podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SPI0_LPC82x.svd.xml
            <register>
               <name>TXCTL</name>
               <description>SPI Transmit Control</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>TXSSEL0_N</name>
                     <description>Transmit Slave Select 0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSSEL1_N</name>
                     <description>Transmit Slave Select 1</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSSEL2_N</name>
                     <description>Transmit Slave Select 2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSSEL3_n</name>
                     <description>Transmit Slave Select 3</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOT</name>
                     <description>End of Transfer</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EOF</name>
                     <description>End of Frame</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXIGNORE</name>
                     <description>Receive Ignore</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LEN</name>
                     <description>Data transfer Length</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV</name>
               <description>SPI clock Divider</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>DIVVAL</name>
                     <description>Rate divider value. Specifies how the PCLK for the SPI is divided to produce the SPI clock rate in master mode.  DIVVAL is -1 encoded such that the value 0 results in PCLK/1, the value 1 results in PCLK/2, up to the maximum possible divide value of 0xFFFF, which results in PCLK/65536</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTAT</name>
               <description>SPI Interrupt Status</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <resetValue>0x2</resetValue>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOV</name>
                     <description>Receiver Overrun interrupt flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUR</name>
                     <description>Transmitter Underrun interrupt flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSA</name>
                     <description>Slave Select Assert</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SSD</name>
                     <description>Slave Select Deassert</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
